
* 02197


* 04741
  :LOGBOOK:
  CLOCK: [2019-10-24 Thu 20:12]--[2019-10-24 Thu 21:39] =>  1:27
  :END:


* 04747
  :LOGBOOK:
  CLOCK: [2019-11-09 Sat 13:31]--[2019-11-09 Sat 15:05] =>  1:34
  CLOCK: [2019-11-07 Thu 11:21]--[2019-11-07 Thu 11:31] =>  0:10
  CLOCK: [2019-11-06 Wed 21:45]--[2019-11-06 Wed 23:16] =>  1:31
  CLOCK: [2019-11-06 Wed 18:49]--[2019-11-06 Wed 19:20] =>  0:31
  CLOCK: [2019-11-06 Wed 17:29]--[2019-11-06 Wed 18:18] =>  0:49
  CLOCK: [2019-11-06 Wed 15:54]--[2019-11-06 Wed 17:02] =>  1:08
  CLOCK: [2019-11-06 Wed 13:04]--[2019-11-06 Wed 13:17] =>  0:13
  CLOCK: [2019-11-06 Wed 12:20]--[2019-11-06 Wed 12:38] =>  0:18
  CLOCK: [2019-11-05 Tue 11:41]--[2019-11-05 Tue 12:54] =>  1:13
  CLOCK: [2019-11-03 Sun 22:14]--[2019-11-03 Sun 22:52] =>  0:38
  CLOCK: [2019-11-02 Sat 17:18]--[2019-11-02 Sat 18:33] =>  1:15
  CLOCK: [2019-11-02 Sat 14:48]--[2019-11-02 Sat 15:34] =>  0:46
  CLOCK: [2019-11-01 Fri 22:55]--[2019-11-02 Sat 00:05] =>  1:10
  CLOCK: [2019-11-01 Fri 17:14]--[2019-11-01 Fri 17:44] =>  0:30
  CLOCK: [2019-10-31 Thu 16:26]--[2019-10-31 Thu 16:55] =>  0:29
  CLOCK: [2019-10-31 Thu 13:24]--[2019-10-31 Thu 15:00] =>  1:36
  CLOCK: [2019-10-29 Tue 20:52]--[2019-10-29 Tue 22:04] =>  1:12
  CLOCK: [2019-10-29 Tue 19:47]--[2019-10-29 Tue 20:48] =>  1:01
  CLOCK: [2019-10-29 Tue 18:25]--[2019-10-29 Tue 18:49] =>  0:24
  CLOCK: [2019-10-27 Sun 19:44]--[2019-10-27 Sun 20:52] =>  1:08
  CLOCK: [2019-10-27 Sun 17:18]--[2019-10-27 Sun 18:06] =>  0:48
  CLOCK: [2019-10-27 Sun 16:26]--[2019-10-27 Sun 16:56] =>  0:30
  CLOCK: [2019-10-27 Sun 15:38]--[2019-10-27 Sun 16:12] =>  0:34
  CLOCK: [2019-10-27 Sun 14:54]--[2019-10-27 Sun 15:10] =>  0:16
  CLOCK: [2019-10-26 Sat 14:40]--[2019-10-26 Sat 15:00] =>  0:20
  CLOCK: [2019-10-25 Fri 20:16]--[2019-10-25 Fri 21:21] =>  1:05
  CLOCK: [2019-10-25 Fri 19:21]--[2019-10-25 Fri 20:12] =>  0:51
  CLOCK: [2019-10-24 Thu 16:04]--[2019-10-24 Thu 18:04] =>  2:00
  :END:

  Applet is deprecated in Java 8 and removed in Java 11.  Java Web
  Start is the way to go.

  The methods ~.valueOf~ of many built-in classes are called static
  factory methods.  They construct an object of the correspondent
  class from their argument, whereas ~.parse*~ family of methods
  return a value of the correspondent primitive type.

  The names ending with /listener/ are mostly of interfaces to be
  implemented.

  References:
   * [[https://www.geeksforgeeks.org/inner-class-java/][Inner class in java]]
   * [[https://docs.oracle.com/javase/tutorial/uiswing/index.html][Trail: Creating a GUI With JFC/Swing]]
   * [[https://docs.oracle.com/javase/tutorial/uiswing/components/componentlist.html][How to Use Various Components]]
   * [[https://docs.oracle.com/javase/tutorial/uiswing/layout/layoutlist.html][How to Use Various Layout Managers]]
   * [[https://chortle.ccsu.edu/Java5/Notes/chap55/ch55_10.html][AWT Hierarchy]]
   * [[https://docs.oracle.com/javase/8/docs/api/java/awt/package-tree.html][java.awt Class Hierarchy (Java Platform SE 8)]]
   * [[https://docs.oracle.com/javase/8/docs/api/java/applet/package-tree.html][java.applet Class Hierarchy (Java Platform SE 8)]]
   * [[https://docs.oracle.com/javase/8/docs/api/javax/swing/package-tree.html][javax.swing Class Hierarchy (Java Platform SE 8)]]
   * [[https://www.ibm.com/support/knowledgecenter/en/SS2HSB_8.1.0/com.ibm.iis.ii.analyzingvis.doc/topics/eas_tsk_settingmozillafirefoxtousereqjavawebstart.html][Setting Mozilla Firefox to use the required Java Web Start]]
   * [[https://docs.oracle.com/javase/8/docs/api/javax/swing/JFrame.html][Class JFrame]]
   * [[https://docs.oracle.com/javase/tutorial/uiswing/components/frame.html][How to Make Frames (Main Windows)]]
   * [[https://docs.oracle.com/javase/tutorial/uiswing/layout/border.html][How to Use BorderLayout]]
   * [[https://docs.oracle.com/javase/tutorial/uiswing/events/itemlistener.html][How to Write an Item Listener]]


* A Tour of C++
  :LOGBOOK:
  CLOCK: [2019-10-23 Wed 17:45]--[2019-10-23 Wed 18:37] =>  0:52
  CLOCK: [2019-10-23 Wed 15:30]--[2019-10-23 Wed 17:14] =>  1:44
  CLOCK: [2019-10-22 Tue 20:54]--[2019-10-22 Tue 21:56] =>  1:02
  :END:

  [[https://learning.oreilly.com/api/v1/dashboard/continue/9780134998053][Continue Reading]]

  * [[https://en.cppreference.com/w/cpp/language/initializer_list][Constructors and member initializer lists]]
  * [[https://www.ibm.com/support/knowledgecenter/SSGH3R_16.1.0/com.ibm.xlcpp161.aix.doc/language_ref/constexpr_functions.html][Constexpr functions (C++11)]]


* The C Programming Language

  [[https://learning.oreilly.com/api/v1/dashboard/continue/9780133086249][Continue Reading]]

  * [[https://www.geeksforgeeks.org/storage-classes-in-c/][Storage Classes in C]]


* Effective Java

  [[https://learning.oreilly.com/api/v1/dashboard/continue/9780134686097/][Continue Reading]]


* Java Swing

  [[https://learning.oreilly.com/api/v1/dashboard/continue/0596004087][Continue Reading]]


* The Morning Myth

  [[https://learning.oreilly.com/api/v1/dashboard/continue/9781119537755][Continue Reading]]


** Preface
   :LOGBOOK:
   CLOCK: [2019-11-14 Thu 16:50]--[2019-11-14 Thu 17:30] =>  0:40
   :END:

   [[https://learning.oreilly.com/library/view/the-morning-myth/9781119537755/f04.xhtml][Preface]]


** Chapter 1
   :LOGBOOK:
   CLOCK: [2019-11-27 Wed 13:50]--[2019-11-27 Wed 14:52] =>  1:02
   :END:

   [[https://learning.oreilly.com/library/view/the-morning-myth/9781119537755/c01.xhtml][Confessions of a Stigmatized Night Owl: How Early Rising Nearly Destroyed My Business (and Did Destroy My Education)]]


** Chapter 2
   :LOGBOOK:
   CLOCK: [2019-11-27 Tue 20:15]--[2019-11-27 Tue 21:05] =>  0:50
   :END:

   [[https://learning.oreilly.com/library/view/the-morning-myth/9781119537755/c02.xhtml][The Brainwashing: Society Stigmatizes Night Owls—and People Buy It]]


** Chapter 3
   :LOGBOOK:
   CLOCK: [2019-12-03 Tue 14:05]--[2019-12-03 Tue 14:55] =>  0:50
   :END:

   [[https://learning.oreilly.com/library/view/the-morning-myth/9781119537755/c03.xhtml][The Prison: How Our Society’s Discrimination Harms Night Owls]]


** Chapter 12
  :LOGBOOK:
  CLOCK: [2019-11-12 Tue 16:20]--[2019-11-12 Tue 18:20] =>  2:00
  :END:

  [[https://learning.oreilly.com/library/view/the-morning-myth/9781119537755/c12.xhtml][Night Owl Discrimination and Sleep-Shaming: The Time Has Come to End Discrimination Against Night Owls]]


* Introduction to German

  A course from iTunes U by Phil Roggenbuck and Miriam Walsh

** Greetings
   :LOGBOOK:
   CLOCK: [2019-11-14 Thu 12:54]--[2019-11-14 Thu 14:00] =>  1:06
   CLOCK: [2019-11-14 Thu 12:35]--[2019-11-14 Thu 12:51] =>  0:16
   CLOCK: [2019-11-13 Wed 20:45]--[2019-11-14 Thu 01:11] =>  4:26
   CLOCK: [2019-11-13 Wed 18:43]--[2019-11-13 Wed 20:19] =>  1:36
   CLOCK: [2019-11-13 Wed 12:53]--[2019-11-13 Wed 14:15] =>  1:22
   CLOCK: [2019-11-13 Wed 12:21]--[2019-11-13 Wed 12:31] =>  0:10
   CLOCK: [2019-11-13 Wed 11:42]--[2019-11-13 Wed 12:05] =>  0:23
   :END:

   Reference:
   * [[http://joycep.myweb.port.ac.uk/pronounce/consonr.html][The German Consonant 'r']]


** Directions
   :LOGBOOK:
   CLOCK: [2019-11-15 Fri 15:32]--[2019-11-15 Fri 15:59] =>  0:27
   :END:


** Numbers
   :LOGBOOK:
   CLOCK: [2020-01-13 Mon 16:32]--[2020-01-13 Mon 17:09] =>  0:37
   CLOCK: [2019-11-15 Fri 16:23]--[2019-11-15 Fri 17:09] =>  0:46
   :END:

   Nummer

   eins zwei drei vier fünf sechs sieben acht neun zehn
   zwanzig dreißig vierzig fünfzig sechzig siebzig achtzig neunzig
   hundert einhundert tausend eintausend


** Colors


** Days of the week


** Alphabet
